#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_record.mail1-record will be created
  + resource "aws_route53_record" "mail1-record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "n0syn.com"
      + records         = [
          + "10 mx1.improvmx.com.",
          + "20 mx2.improvmx.com.",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "Z01396533PMY30KC4YNAB"
    }

  # aws_route53_record.txt will be created
  + resource "aws_route53_record" "txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "n0syn.com"
      + records         = [
          + "v=spf1 include:spf.improvmx.com ~all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z01396533PMY30KC4YNAB"
    }

  # module.acm_request_certificate.aws_acm_certificate.default[0] will be created
  + resource "aws_acm_certificate" "default" {
      + arn                       = (known after apply)
      + domain_name               = "n0syn.com"
      + domain_validation_options = [
          + {
              + domain_name           = "n0syn.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.n0syn.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "www.n0syn.com",
        ]
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm_request_certificate.aws_acm_certificate_validation.default[0] will be created
  + resource "aws_acm_certificate_validation" "default" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm_request_certificate.aws_route53_record.default["n0syn.com"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z01396533PMY30KC4YNAB"
    }

  # module.acm_request_certificate.aws_route53_record.default["www.n0syn.com"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z01396533PMY30KC4YNAB"
    }

  # module.cloudfront_s3_cdn.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cloudfront_s3_cdn.data.aws_iam_policy_document.s3_website_origin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_website_origin"  {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::rhill-n0syn-com-origin/*",
            ]
          + sid       = "S3GetObjectForCloudFront"

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.cloudfront_s3_cdn.aws_cloudfront_distribution.default[0] will be created
  + resource "aws_cloudfront_distribution" "default" {
      + aliases                        = (known after apply)
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Managed by Terraform"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Name" = "rhill-n0syn-com"
        }
      + tags_all                       = {
          + "Name" = "rhill-n0syn-com"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 300
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "rhill-n0syn-com"
          + trusted_key_groups     = []
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "rhill-n0syn-com"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = (known after apply)
          + minimum_protocol_version       = (known after apply)
          + ssl_support_method             = (known after apply)
        }
    }

  # module.cloudfront_s3_cdn.aws_cloudfront_origin_access_identity.default[0] will be created
  + resource "aws_cloudfront_origin_access_identity" "default" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "rhill-n0syn-com"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.cloudfront_s3_cdn.aws_s3_bucket.origin[0] will be created
  + resource "aws_s3_bucket" "origin" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "rhill-n0syn-com-origin"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Attributes" = "origin"
          + "Name"       = "rhill-n0syn-com-origin"
        }
      + tags_all                    = {
          + "Attributes" = "origin"
          + "Name"       = "rhill-n0syn-com-origin"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "n0syn.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3600
        }
      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "www.n0syn.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3600
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website {
          + error_document = "index.html"
          + index_document = "index.html"
        }
    }

  # module.cloudfront_s3_cdn.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = "rhill-n0syn-com-origin"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cloudfront_s3_cdn.module.dns.aws_route53_record.default[0] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "n0syn.com"
      + type            = "A"
      + zone_id         = "Z01396533PMY30KC4YNAB"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cloudfront_s3_cdn.module.dns.aws_route53_record.default[1] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.n0syn.com"
      + type            = "A"
      + zone_id         = "Z01396533PMY30KC4YNAB"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cloudfront_s3_cdn.module.dns.aws_route53_record.ipv6[0] will be created
  + resource "aws_route53_record" "ipv6" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "n0syn.com"
      + type            = "AAAA"
      + zone_id         = "Z01396533PMY30KC4YNAB"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cloudfront_s3_cdn.module.dns.aws_route53_record.ipv6[1] will be created
  + resource "aws_route53_record" "ipv6" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.n0syn.com"
      + type            = "AAAA"
      + zone_id         = "Z01396533PMY30KC4YNAB"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cloudfront_s3_cdn.module.logs.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy"  {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)
    }

  # module.cloudfront_s3_cdn.module.logs.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "ForceSSLOnlyAccess"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.cloudfront_s3_cdn.module.logs.aws_s3_bucket.default[0] will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "rhill-n0syn-com-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Attributes" = "logs"
          + "Name"       = "rhill-n0syn-com-logs"
        }
      + tags_all                    = {
          + "Attributes" = "logs"
          + "Name"       = "rhill-n0syn-com-logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 5
          + enabled                                = true
          + id                                     = "rhill-n0syn-com-logs"

          + expiration {
              + days = 90
            }

          + noncurrent_version_expiration {
              + days = 90
            }

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "GLACIER"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }
    }

  # module.cloudfront_s3_cdn.module.logs.aws_s3_bucket_ownership_controls.default[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cloudfront_s3_cdn.module.logs.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cloudfront_s3_cdn.module.logs.aws_s3_bucket_public_access_block.default[0] will be created
  + resource "aws_s3_bucket_public_access_block" "default" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cloudfront_s3_cdn.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
  + resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
      + create_duration  = "30s"
      + destroy_duration = "30s"
      + id               = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket = "rhill-n0syn-com-origin"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @robert-hill, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy`*